Revit 2025 API
RebarSpliceByRulesRunOutPosition Enumeration
 Describes the run-out position.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum RebarSpliceByRulesRunOutPosition
Public Enumeration RebarSpliceByRulesRunOutPosition
public enum class RebarSpliceByRulesRunOutPosition
type RebarSpliceByRulesRunOutPosition
Members
Member name | Value | Description
Start | 0 |  The rest will remain at the start of the bar.
End | 1 |  The rest will remain at the end of the bar.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace